package yyl.example.demo.oshi;

/**
 * <h3>OSHI</h3><br>
 * <a href="https://github.com/oshi/oshi">GIT地址</a><br>
 * OSHI 是基于 JNA 的（本地）操作系统和硬件信息库。它不需要安装任何其他额外的本地库，旨在提供一种跨平台的实现来检索系统信息，例如操作系统版本、进程、内存和 CPU 使用率、磁盘和分区、设备、传感器等。 <br>
 * 使用 OSHI 可以对应用程序进行监控，可以对应用程序所在的服务器资源进行监控，还可以监控到其他许多指标，如下： <br>
 * 1、计算机系统和固件，底板<br>
 * 2、操作系统和版本/内部版本<br>
 * 3、物理（核心）和逻辑（超线程）CPU，处理器组，NUMA节点<br>
 * 4、系统和每个处理器的负载百分比和滴答计数器<br>
 * 5、CPU正常运行时间，进程和线程<br>
 * 6、进程正常运行时间，CPU，内存使用率，用户/组，命令行<br>
 * 7、已使用/可用的物理和虚拟内存<br>
 * 8、挂载的文件系统（类型，可用空间和总空间）<br>
 * 9、磁盘驱动器（型号，序列号，大小）和分区<br>
 * 10、网络接口（IP，带宽输入/输出）<br>
 * 11、电池状态（电量百分比，剩余时间，电量使用情况统计信息）<br>
 * 12、连接的显示器（带有EDID信息）<br>
 * 13、USB设备<br>
 * 14、传感器（温度，风扇速度，电压）<br>
 * <br>
 * 支持的平台：<br>
 * - Windows<br>
 * - Linux<br>
 * - macOS<br>
 * - UNIX (AIX, FreeBSD, OpenBSD, Solaris)<br>
 */